RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/***************************************************************************//**
* \file cy_mixer.h
* \version 1.0
*
* Provides an API declaration of the mixer driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2024, Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_mixer
* \{
* The Mixer driver provides APIs to configure the audio mixer.
*
* The functions and other declarations used in this driver are in cy_mixer.h.
* You can include cy_pdl.h (ModusToolbox only) to get access to all functions
* and declarations in the PDL.
*
* Features:
* * Combines multiple PCM source streams into a single PCM destination stream.
* * Typically, a PCM source stream consists of a repetition of a PCM sample pattern
*   in memory. The number of repetitions is dynamic; that is, at the stream start,
*   the stream end may not be known. Typically, a system event activates (starts)
*   a PCM source stream and another system event deactivates (ends) a PCM source
*   stream.
* * A PCM source stream can be gain/volume controlled.
* * A PCM source stream can be faded in (typically at the stream start) and faded
*   out (typically just before the stream end).
* * A PCM source stream sample frequency has a specific ratio with respect to the
*   PCM destination stream sample frequency: 0.5x, 1x, 2x, 3x, 4x, 6x, 8x, 12x.
*   The mixer upscales (2x, 3x, ..., 12x) or down-scales (0.5x) the PCM source stream
*   to the PCM destination stream.
* * The PCM destination stream can be gain/volume controlled.
* * The PCM destination stream can be faded in and faded out.
* * Fixed PCM sample formatting: 16-bit pairs.
* * I2S transmitter with master and slave functionality. See the device datasheet to
*   confirm whether this feature is supported.
*
* \section group_mixer_configuration Configuration Considerations
*
* To set up an audio mixer, initialize the mixer destination and one or more
* source streams.
*
* The mixer destination can be configured by providing all of the parameters
* in the \ref cy_stc_mixer_dst_config_t structure. Then call the
* \ref Cy_Mixer_DestinationInit function to initialize the mixer destination.
* Additional APIs are provided to configure and control the mixer destination
* after initialization.
*
* A mixer source can be configured by providing all of the parameters in the
* \ref cy_stc_mixer_src_config_t structure. Then call the \ref Cy_Mixer_SourceInit
* function to initialize the mixer source. Additional APIs are provided to
* configure and control the mixer source after initialization.
*
* For the mixer to operate, the destination and one or more sources must be
* enabled and activated. Typically, enabling a source is done at mixer
* initialization time and activating/deactivating a source is done at a finer
* grain, based on system events that activate (start) and/or deactivate (end)
* PCM source streams.
*
* Destination initialization example:
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_DestinationInit
*
* Source initialization example:
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_SourceInit
*
* Mixer sources and destinations may be written and read by the MCU (via the
* provided APIs: \ref Cy_Mixer_Src_FifoWriteData, \ref Cy_Mixer_Dst_FifoReadData)
* or by DMA. If using DMA, the DMA channel should be previously configured.
* Triggers generated by the Mixer can be used to initiate DMA transfers to and
* from the mixer source and destination FIFOs.
*
* \section group_mixer_more_information More Information.
* See the Mixer chapter of the device technical reference manual (TRM).
*
* \section group_mixer_changelog Changelog
*
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>The initial version.</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_mixer_macros Macros
* \defgroup group_mixer_functions Functions
* \defgroup group_mixer_data_structures Data Structures
* \defgroup group_mixer_enums Enumerated Types
*/

#if !defined(__CY_MIXER_H__)
#define __CY_MIXER_H__

#include "cy_device_headers.h"
#include "cy_syslib.h"
#include <stdbool.h>

#if defined (CY_IP_MXMIXER)

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/**
* \addtogroup group_mixer_macros
* \{
*/

/** Driver major version */
#define CY_MIXER_DRV_VERSION_MAJOR   1
/** Driver minor version */
#define CY_MIXER_DRV_VERSION_MINOR   0
/** The Mixer driver identifier */
#define CY_MIXER_ID                (CY_PDL_DRV_ID(0x25U))

/** Mixer gain code: mute */
#define CY_MIXER_GAIN_CODE_MUTE (0U)
/** Mixer gain code: no gain */
#define CY_MIXER_GAIN_CODE_NONE (115U)
/** Mixer gain code: maximum gain */
#define CY_MIXER_GAIN_CODE_MAX  (127U)

/** \} group_mixer_macros */

/**
* \addtogroup group_mixer_enums
* \{
*/

/** Mixer Word Size */
typedef enum
{
    CY_MIXER_TX_WD_SIZE_16BITS      = 4U,    /**< MIXER transmitter PCM Word Size - always uses 16-bit PCM words. */
} cy_en_mixer_tx_wd_size_t;

/** Mixer TX Format */
typedef enum
{
    CY_MIXER_TX_FMT_LEFT_DELAYED    = 0U,    /**< MIXER transmitter Format left delayed */
    CY_MIXER_TX_FMT_LEFT            = 1U,    /**< MIXER transmitter Format left */
    CY_MIXER_TX_FMT_RIGHT_DELAYED   = 2U,    /**< MIXER transmitter Format right delayed */
    CY_MIXER_TX_FMT_RIGHT           = 3U,    /**< MIXER transmitter Format right */
} cy_en_mixer_tx_fmt_t;

/** Mixer TX Mode */
typedef enum
{
    CY_MIXER_TX_MODE_SLAVE          = 0U,    /**< MIXER transmitter slave mode */
    CY_MIXER_TX_MODE_MASTER         = 1U,    /**< MIXER transmitter master mode */
} cy_en_mixer_tx_mode_t;

/** Mixer TX Interface Clock Selection */
typedef enum
{
    CY_MIXER_TX_CLK_SEL_SRSS        = 0U,    /**< MIXER transmitter Clock Select SRSS Internal */
    CY_MIXER_TX_CLK_SEL_MASTER_IFC  = 1U,    /**< MIXER transmitter Clock Select from Master Interface */
} cy_en_mixer_tx_clk_sel_t;

