RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/** Mixer Channel */
typedef enum
{
    CY_MIXER_CHANNEL0               = 0U,    /**< MIXER Channel 0 */
    CY_MIXER_CHANNEL1               = 1U,    /**< MIXER Channel 1 */
} cy_en_mixer_channel_t;

/** Mixer Tx Interrupt Sources */
typedef enum
{
    CY_MIXER_TX_FIFO_UNDERFLOW      = 0U,    /**< MIXER Fifo underflow interrupt */
    CY_MIXER_TX_IFC_UNDERFLOW       = 1U,    /**< MIXER Interface underflow interrupt */
} cy_stc_mixer_tx_int_src_t;

/** Mixer Source Interrupt Sources */
typedef enum
{
    CY_MIXER_SRC_FIFO_TRIGGER       = 0U,    /**< MIXER source Fifo trigger interrupt */
    CY_MIXER_SRC_FIFO_OVERFLOW      = 1U,    /**< MIXER source Fifo overflow interrupt */
    CY_MIXER_SRC_FADE_OUT           = 2U,    /**< MIXER source fade out interrupt */
} cy_en_mixer_src_interrupt_t;

/** Mixer Destination Interrupt Sources */
typedef enum
{
    CY_MIXER_DST_FIFO_TRIGGER       = 0U,    /**< MIXER destination Fifo trigger interrupt */
    CY_MIXER_DST_FIFO_UNDERFLOW     = 1U,    /**< MIXER destination Fifo underflow interrupt */
    CY_MIXER_DST_FADE_OUT           = 2U,    /**< MIXER destination fade out interrupt */
} cy_en_mixer_dst_interrupt_t;

/** Mixer Sample Frequency Upscale Ratio */
typedef enum
{
    CY_MIXER_SRC_FREQ_DOWNSAMPLE_BY_2   = 0U,    /**< MIXER source frequency down sample by 2 */
    CY_MIXER_SRC_FREQ_NO_RESAMPLE       = 1U,    /**< MIXER source frequency no resampling, same */
    CY_MIXER_SRC_FREQ_UPSAMPLE_BY_2     = 2U,    /**< MIXER source frequency up sampling by 2 (0.5) */
    CY_MIXER_SRC_FREQ_UPSAMPLE_BY_3     = 3U,    /**< MIXER source frequency up sampling by 3 */
    CY_MIXER_SRC_FREQ_UPSAMPLE_BY_4     = 4U,    /**< MIXER source frequency up sampling by 4 */
    CY_MIXER_SRC_FREQ_UPSAMPLE_BY_6     = 5U,    /**< MIXER source frequency up sampling by 6 */
    CY_MIXER_SRC_FREQ_UPSAMPLE_BY_8     = 6U,    /**< MIXER source frequency up sampling by 8 */
    CY_MIXER_SRC_FREQ_UPSAMPLE_BY_12    = 7U,    /**< MIXER source frequency up sampling by 12 */
} cy_en_mixer_src_fs_ratio_t;

/** Mixer source channel data select */
/**
* \note
* This enum specifies selection of the channel's 16-bit PCM data from the source FIFO data[31:0].
**/
typedef enum
{
    CY_MIXER_SRC_DATA_LOW   = 0U, /**< MIXER source data from data[15:0] (default setting) */
    CY_MIXER_SRC_DATA_HIGH  = 1U, /**< MIXER source data from data[31:16] */
    CY_MIXER_SRC_CONSTANT_0 = 2U, /**< MIXER source data is a constant PCM data value of "0", no source FIFO */
} cy_en_mixer_src_data_t;

/** Mixer Fade Code Select */
typedef enum
{
    CY_MIXER_CODE_MUTE = CY_MIXER_GAIN_CODE_MUTE, /**< MIXER fade gain code 0 */
    CY_MIXER_CODE_SAME = CY_MIXER_GAIN_CODE_NONE, /**< MIXER fade gain code 115 */
} cy_en_mixer_fade_code_t;

/** Mixer status definitions. */
typedef enum
{
    CY_MIXER_SUCCESS   = 0x00UL,                                    /**< Successful. */
    CY_MIXER_BAD_PARAM = CY_MIXER_ID | CY_PDL_STATUS_ERROR | 0x01UL /**< One or more invalid parameters. */
} cy_en_mixer_status_t;

/** \} group_mixer_enums */

/**
* \addtogroup group_mixer_data_structures
* \{
*/

/** Mixer Source initialization configuration. */
typedef struct
{
    cy_en_mixer_src_fs_ratio_t fsRatio;  /**< Sample frequency upscale ratio */
    cy_en_mixer_src_data_t     ch0sel;   /**< Channel 0 bit allocation */
    cy_en_mixer_src_data_t     ch1sel;   /**< Channel 0 bit allocation */
    cy_en_mixer_fade_code_t    fadeCode; /**< Initial fade state */
    uint8_t                    gainCode; /**< Gain code in the range [0, 127]. */
    uint8_t                    trgLevel; /**< Trigger level */
} cy_stc_mixer_src_config_t;

/** Mixer Destination initialization configuration. */
typedef struct
{
    cy_en_mixer_fade_code_t fadeCode; /**< Initial fade state */
    uint8_t                 gainCode; /**< Gain code in the range [0, 127]. */
    uint8_t                 trgLevel; /**< Trigger level */
} cy_stc_mixer_dst_config_t;

/** Mixer Transmit initialization configuration. */
typedef struct
{
    cy_en_mixer_tx_wd_size_t    wordSize;    /**< PCM Word Size, only 16-bits */
    cy_en_mixer_tx_fmt_t        txFormat;    /**< I2S Format */
    cy_en_mixer_tx_mode_t       txMode;      /**< Master Mode */
    uint8_t                     clkDiv;      /**< I2S Interface clock divider [1...255] */
    cy_en_mixer_tx_clk_sel_t    clkSel;      /**< Clock Select from either SRSS (internal) or Master Ifc */
    bool                        clkPol;      /**< Clock polarity, as is or inverted */
    bool                        wSelPol;     /**< Word select polarity, as is or inverted */
    bool                        chl0En;      /**< Channel 0 enable */
    bool                        chl1En;      /**< Channel 1 enable */
    uint8_t                     chlSize;     /**< Channel size, [1..32] */
} cy_stc_mixer_tx_config_t;

/** \} group_mixer_data_structures */

/**
* \addtogroup group_mixer_functions
* \{
*/
/*******************************************************************************/
/*                      Global initialization functions                        */
/*******************************************************************************/
cy_en_mixer_status_t Cy_Mixer_SourceInit(volatile MIXER_SRC_STRUCT_Type * base, cy_stc_mixer_src_config_t const * config);
void Cy_Mixer_SourceDeInit(volatile MIXER_SRC_STRUCT_Type * base);
cy_en_mixer_status_t Cy_Mixer_DestinationInit(volatile MIXER_DST_STRUCT_Type * base, cy_stc_mixer_dst_config_t const * config);
void Cy_Mixer_DestinationDeInit(volatile MIXER_DST_STRUCT_Type * base);

#if (defined(MIXER0_TX_PRESENT) && (MIXER0_TX_PRESENT == 1)) || (defined(MIXER1_TX_PRESENT) && (MIXER1_TX_PRESENT == 1))
cy_en_mixer_status_t Cy_Mixer_TransmitInit(volatile MIXER_TX_STRUCT_Type * base, cy_stc_mixer_tx_config_t const * config);
void Cy_Mixer_TransmitDeInit(volatile MIXER_TX_STRUCT_Type * base);
#endif

void Cy_Mixer_SourceStartFadeIn(volatile MIXER_SRC_STRUCT_Type * base, uint16_t pace);
bool Cy_Mixer_SourceHasFadeInCompleted(volatile MIXER_SRC_STRUCT_Type * base);
void Cy_Mixer_SourceStartFadeOut(volatile MIXER_SRC_STRUCT_Type * base, uint16_t pace, bool deact);
bool Cy_Mixer_SourceHasFadeOutCompleted(volatile MIXER_SRC_STRUCT_Type * base);

void Cy_Mixer_DestinationStartFadeIn(volatile MIXER_DST_STRUCT_Type * base, uint16_t pace);
bool Cy_Mixer_DestinationHasFadeInCompleted(volatile MIXER_DST_STRUCT_Type * base);
void Cy_Mixer_DestinationStartFadeOut(volatile MIXER_DST_STRUCT_Type * base, uint16_t pace, bool deact);
bool Cy_Mixer_DestinationHasFadeOutCompleted(volatile MIXER_DST_STRUCT_Type * base);

