RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/*******************************************************************************/
/*                      Mixer Source Control and Status                        */
/*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_SampleFreqRatio(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_src_fs_ratio_t fsRatio);
__STATIC_INLINE void Cy_Mixer_Src_ChannelSelect(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_channel_t channel, cy_en_mixer_src_data_t data);
__STATIC_INLINE void Cy_Mixer_Src_Enable(volatile MIXER_SRC_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Src_Disable(volatile MIXER_SRC_STRUCT_Type * base);

__STATIC_INLINE uint8_t Cy_Mixer_Src_GetCurrentPhase(volatile MIXER_SRC_STRUCT_Type * base);

__STATIC_INLINE void Cy_Mixer_Src_FadeControl(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_fade_code_t fadeCode);

__STATIC_INLINE uint16_t Cy_Mixer_Src_GetCurrentPace(volatile MIXER_SRC_STRUCT_Type * base);

__STATIC_INLINE void Cy_Mixer_Src_FadeInEnable(volatile MIXER_SRC_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Src_FadeInDisable(volatile MIXER_SRC_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Src_FadeOutEnable(volatile MIXER_SRC_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Src_FadeOutDisable(volatile MIXER_SRC_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Src_AutoFadeActivate(volatile MIXER_SRC_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Src_AutoFadeDeactivate(volatile MIXER_SRC_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Src_FadePaceSelect(volatile MIXER_SRC_STRUCT_Type * base, uint16_t pace);

__STATIC_INLINE void Cy_Mixer_Src_GainCodeSelect(volatile MIXER_SRC_STRUCT_Type * base, uint8_t code);

__STATIC_INLINE void Cy_Mixer_Src_FifoTriggerLevel(volatile MIXER_SRC_STRUCT_Type * base, uint8_t level);
__STATIC_INLINE void Cy_Mixer_Src_Mute(volatile MIXER_SRC_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Src_Unmute(volatile MIXER_SRC_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Src_Activate(volatile MIXER_SRC_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Src_Deactivate(volatile MIXER_SRC_STRUCT_Type * base);

__STATIC_INLINE uint8_t Cy_Mixer_Src_GetUsedFifoEntries(volatile MIXER_SRC_STRUCT_Type * base);
__STATIC_INLINE uint8_t Cy_Mixer_Src_GetFifoReadPtr(volatile MIXER_SRC_STRUCT_Type * base);
__STATIC_INLINE uint8_t Cy_Mixer_Src_GetFifoWritePtr(volatile MIXER_SRC_STRUCT_Type * base);

__STATIC_INLINE void Cy_Mixer_Src_FifoWriteData(volatile MIXER_SRC_STRUCT_Type * base, uint32_t data);

__STATIC_INLINE void Cy_Mixer_Src_ClearInterrupt(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_src_interrupt_t intSrc);
__STATIC_INLINE void Cy_Mixer_Src_SetInterrupt(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_src_interrupt_t intSrc);
__STATIC_INLINE void Cy_Mixer_Src_ClearInterruptMask(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_src_interrupt_t intSrc);
__STATIC_INLINE void Cy_Mixer_Src_SetInterruptMask(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_src_interrupt_t intSrc);
__STATIC_INLINE bool Cy_Mixer_Src_IsInterruptActive(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_src_interrupt_t intSrc);

/*******************************************************************************/
/*                   Mixer Destination Control and Status                      */
/*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_Enable(volatile MIXER_DST_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Dst_Disable(volatile MIXER_DST_STRUCT_Type * base);

__STATIC_INLINE void Cy_Mixer_Dst_FadeControl(volatile MIXER_DST_STRUCT_Type * base, cy_en_mixer_fade_code_t fadeCode);

__STATIC_INLINE uint16_t Cy_Mixer_Dst_GetCurrentPace(volatile MIXER_DST_STRUCT_Type * base);

__STATIC_INLINE void Cy_Mixer_Dst_FadeInEnable(volatile MIXER_DST_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Dst_FadeInDisable(volatile MIXER_DST_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Dst_FadeOutEnable(volatile MIXER_DST_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Dst_FadeOutDisable(volatile MIXER_DST_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Dst_AutoFadeActivate(volatile MIXER_DST_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Dst_AutoFadeDeactivate(volatile MIXER_DST_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Dst_FadePaceSelect(volatile MIXER_DST_STRUCT_Type * base, uint16_t pace);

__STATIC_INLINE void Cy_Mixer_Dst_GainCodeSelect(volatile MIXER_DST_STRUCT_Type * base, uint8_t code);

__STATIC_INLINE void Cy_Mixer_Dst_FifoTriggerLevel(volatile MIXER_DST_STRUCT_Type * base, uint8_t level);
__STATIC_INLINE void Cy_Mixer_Dst_Mute(volatile MIXER_DST_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Dst_Unmute(volatile MIXER_DST_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Dst_Activate(volatile MIXER_DST_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Dst_Deactivate(volatile MIXER_DST_STRUCT_Type * base);

__STATIC_INLINE uint8_t Cy_Mixer_Dst_GetUsedFifoEntries(volatile MIXER_DST_STRUCT_Type * base);
__STATIC_INLINE uint8_t Cy_Mixer_Dst_GetFifoReadPtr(volatile MIXER_DST_STRUCT_Type * base);
__STATIC_INLINE uint8_t Cy_Mixer_Dst_GetFifoWritePtr(volatile MIXER_DST_STRUCT_Type * base);

__STATIC_INLINE uint32_t Cy_Mixer_Dst_FifoReadData(volatile MIXER_DST_STRUCT_Type * base);

__STATIC_INLINE void Cy_Mixer_Dst_ClearInterrupt(volatile MIXER_DST_STRUCT_Type * base, cy_en_mixer_dst_interrupt_t intSrc);
__STATIC_INLINE void Cy_Mixer_Dst_SetInterrupt(volatile MIXER_DST_STRUCT_Type * base, cy_en_mixer_dst_interrupt_t intSrc);
__STATIC_INLINE void Cy_Mixer_Dst_ClearInterruptMask(volatile MIXER_DST_STRUCT_Type * base, cy_en_mixer_dst_interrupt_t intSrc);
__STATIC_INLINE void Cy_Mixer_Dst_SetInterruptMask(volatile MIXER_DST_STRUCT_Type * base, cy_en_mixer_dst_interrupt_t intSrc);
__STATIC_INLINE bool Cy_Mixer_Dst_IsInterruptActive(volatile MIXER_DST_STRUCT_Type * base, cy_en_mixer_dst_interrupt_t intSrc);

