RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/*******************************************************************************/
/*                       Mixer Tx Control and Status                           */
/*******************************************************************************/
#if (defined(MIXER0_TX_PRESENT) && (MIXER0_TX_PRESENT == 1)) || (defined(MIXER1_TX_PRESENT) && (MIXER1_TX_PRESENT == 1))

__STATIC_INLINE void Cy_Mixer_Tx_Enable(volatile MIXER_TX_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Tx_Disable(volatile MIXER_TX_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Tx_WordSize(volatile MIXER_TX_STRUCT_Type * base, cy_en_mixer_tx_wd_size_t wdSize);
__STATIC_INLINE void Cy_Mixer_Tx_Format(volatile MIXER_TX_STRUCT_Type * base, cy_en_mixer_tx_fmt_t format);
__STATIC_INLINE void Cy_Mixer_Tx_SelectMode(volatile MIXER_TX_STRUCT_Type * base, cy_en_mixer_tx_mode_t mode);

__STATIC_INLINE void Cy_Mixer_Tx_ClockDivider(volatile MIXER_TX_STRUCT_Type * base, uint8_t clkDiv);
__STATIC_INLINE void Cy_Mixer_Tx_ClockSelect(volatile MIXER_TX_STRUCT_Type * base, cy_en_mixer_tx_clk_sel_t clkSel);
__STATIC_INLINE void Cy_Mixer_Tx_ClockPolarity(volatile MIXER_TX_STRUCT_Type * base, bool polarity);
__STATIC_INLINE void Cy_Mixer_Tx_WordSelectPolarity(volatile MIXER_TX_STRUCT_Type * base, bool polarity);
__STATIC_INLINE void Cy_Mixer_Tx_ChannelEnable(volatile MIXER_TX_STRUCT_Type * base, cy_en_mixer_channel_t channel);
__STATIC_INLINE void Cy_Mixer_Tx_ChannelDisable(volatile MIXER_TX_STRUCT_Type * base, cy_en_mixer_channel_t channel);
__STATIC_INLINE void Cy_Mixer_Tx_ChannelSize(volatile MIXER_TX_STRUCT_Type * base, uint8_t chSize);

__STATIC_INLINE void Cy_Mixer_Tx_Mute(volatile MIXER_TX_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Tx_Unmute(volatile MIXER_TX_STRUCT_Type * base);
__STATIC_INLINE void Cy_Mixer_Tx_ActivateTransmitter(volatile MIXER_TX_STRUCT_Type * base, bool state);
__STATIC_INLINE void Cy_Mixer_Tx_Replay(volatile MIXER_TX_STRUCT_Type * base, bool state);

__STATIC_INLINE void Cy_Mixer_Tx_ClearInterrupt(volatile MIXER_TX_STRUCT_Type * base, cy_stc_mixer_tx_int_src_t intSrc);
__STATIC_INLINE void Cy_Mixer_Tx_SetInterrupt(volatile MIXER_TX_STRUCT_Type * base, cy_stc_mixer_tx_int_src_t intSrc);
__STATIC_INLINE void Cy_Mixer_Tx_ClearInterruptMask(volatile MIXER_TX_STRUCT_Type * base, cy_stc_mixer_tx_int_src_t intSrc);
__STATIC_INLINE void Cy_Mixer_Tx_SetInterruptMask(volatile MIXER_TX_STRUCT_Type * base, cy_stc_mixer_tx_int_src_t intSrc);
__STATIC_INLINE bool Cy_Mixer_Tx_IsInterruptActive(volatile MIXER_TX_STRUCT_Type * base, cy_stc_mixer_tx_int_src_t intSrc);

#endif /* (defined(MIXER0_TX_PRESENT) && (MIXER0_TX_PRESENT == 1)) || (defined(MIXER1_TX_PRESENT) && (MIXER1_TX_PRESENT == 1)) */

/*******************************************************************************
* Function Name: Cy_Mixer_Src_SampleFreqRatio
****************************************************************************//**
*
* Set the source sample frequency upscale ratio
*
* \param base pointer to the Mixer SRC Struct instance
* \param fsRatio \ref cy_en_mixer_src_fs_ratio_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_SampleFreqRatio(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_src_fs_ratio_t fsRatio)
{
    CY_REG32_CLR_SET(MIXER_SRC_STRUCT_SRC_CTL(base), MIXER_MIXER_SRC_STRUCT_SRC_CTL_FS_RATIO, fsRatio);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_ChannelSelect
****************************************************************************//**
*
* Channel selection, specifies selection of the channel's 16-bit PCM data from
* source FIFO data[31:0].
*
* \param base pointer to the Mixer SRC Struct instance
* \param channel \ref cy_en_mixer_channel_t
* \param data \ref cy_en_mixer_src_data_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_ChannelSelect(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_channel_t channel, cy_en_mixer_src_data_t data)
{
    switch (channel)
    {
    case CY_MIXER_CHANNEL0:
        CY_REG32_CLR_SET(MIXER_SRC_STRUCT_SRC_CTL(base), MIXER_MIXER_SRC_STRUCT_SRC_CTL_CH0_SEL, data);
        break;
    case CY_MIXER_CHANNEL1:
        CY_REG32_CLR_SET(MIXER_SRC_STRUCT_SRC_CTL(base), MIXER_MIXER_SRC_STRUCT_SRC_CTL_CH1_SEL, data);
        break;
    default:
        /* Invalid channel */
        CY_ASSERT_L3(false);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_Enable
****************************************************************************//**
*
* Mixer source enable
*
* \param base pointer to the Mixer SRC Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_SourceInit
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_Enable(volatile MIXER_SRC_STRUCT_Type * base)
{
    MIXER_SRC_STRUCT_SRC_CTL(base) |= MIXER_MIXER_SRC_STRUCT_SRC_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_Disable
****************************************************************************//**
*
* Mixer source disable
*
* \param base pointer to the Mixer SRC Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Src_Disable
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_Disable(volatile MIXER_SRC_STRUCT_Type * base)
{
    MIXER_SRC_STRUCT_SRC_CTL(base) &= ~MIXER_MIXER_SRC_STRUCT_SRC_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_GetCurrentPhase
****************************************************************************//**
*
* Get the current FIR phase value. An upscale ratio of "n" uses a n polyphase
* FIR filter. The phases are numbered [0, n-1].
*
* \param base pointer to the Mixer SRC Struct instance
*
* \return The current FIR phase value.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Mixer_Src_GetCurrentPhase(volatile MIXER_SRC_STRUCT_Type * base)
{
    return (uint8_t)(_FLD2VAL(MIXER_MIXER_SRC_STRUCT_SRC_STATUS_PHASE, MIXER_SRC_STRUCT_SRC_STATUS(base)));
}

