RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/*******************************************************************************
* Function Name: Cy_Mixer_Src_FadeControl
****************************************************************************//**
*
* Set the source fade control (Gain code in the range [0, 115])
*
* \param base pointer to the Mixer SRC Struct instance
* \param fadeCode \ref cy_en_mixer_fade_code_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_FadeControl(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_fade_code_t fadeCode)
{
    MIXER_SRC_STRUCT_SRC_FADE_CTL(base) = _VAL2FLD(MIXER_MIXER_SRC_STRUCT_SRC_FADE_CTL_CODE, fadeCode);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_GetCurrentPace
****************************************************************************//**
*
* Get the current source fading pace counter value. SRC_FADE_CTL.PACE value of "n"
* reuses a specific fade value "n+1" times.
*
* \param base pointer to the Mixer SRC Struct instance
*
* \return The current fading pace counter value
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_Mixer_Src_GetCurrentPace(volatile MIXER_SRC_STRUCT_Type * base)
{
    return (uint8_t)(_FLD2VAL(MIXER_MIXER_SRC_STRUCT_SRC_FADE_STATUS_PACE, MIXER_SRC_STRUCT_SRC_FADE_STATUS(base)));
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_FadeInEnable
****************************************************************************//**
*
* Mixer source fade in enable (SW sets this field to '1' to start "fade in"
* functionality. HW clears this field to '0' to indicate that "fade in" has
* completed)
*
* FADE_IN and FADE_OUT should be used mutually exclusively. However, if
* "fade in" is desired while "fading out", SW can set FADE_IN to '1' and clear
* FADE_OUT to '0'. "Fade in" will commence from the current CODE value.
* Similarly,  if "fade out" is desired while "fading in", SW can set FADE_OUT
* to '1' and clear FADE_IN to '0'. "Fade out" will commence from the current
* CODE value.
*
* \param base pointer to the Mixer SRC Struct instance
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_FadeInEnable(volatile MIXER_SRC_STRUCT_Type * base)
{
    MIXER_SRC_STRUCT_SRC_FADE_CMD(base) |= MIXER_MIXER_SRC_STRUCT_SRC_FADE_CMD_FADE_IN_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_FadeInDisable
****************************************************************************//**
*
* Mixer source fade in disable
*
* \param base pointer to the Mixer SRC Struct instance
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_FadeInDisable(volatile MIXER_SRC_STRUCT_Type * base)
{
    MIXER_SRC_STRUCT_SRC_FADE_CMD(base) &= ~MIXER_MIXER_SRC_STRUCT_SRC_FADE_CMD_FADE_IN_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_FadeOutEnable
****************************************************************************//**
*
* Mixer source fade out enable
*
* \param base pointer to the Mixer SRC Struct instance
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_FadeOutEnable(volatile MIXER_SRC_STRUCT_Type * base)
{
    MIXER_SRC_STRUCT_SRC_FADE_CMD(base) |= MIXER_MIXER_SRC_STRUCT_SRC_FADE_CMD_FADE_OUT_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_FadeOutDisable
****************************************************************************//**
*
* Mixer source fade out disable
*
* \param base pointer to the Mixer SRC Struct instance
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_FadeOutDisable(volatile MIXER_SRC_STRUCT_Type * base)
{
    MIXER_SRC_STRUCT_SRC_FADE_CMD(base) &= ~MIXER_MIXER_SRC_STRUCT_SRC_FADE_CMD_FADE_OUT_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_AutoFadeActivate
****************************************************************************//**
*
* Configures the mixer source to NOT deactivate when "fade out" completes
*
* \param base pointer to the Mixer SRC Struct instance
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_AutoFadeActivate(volatile MIXER_SRC_STRUCT_Type * base)
{
    MIXER_SRC_STRUCT_SRC_FADE_CMD(base) &= ~MIXER_MIXER_SRC_STRUCT_SRC_FADE_CMD_AUTO_DEACTIVATE_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_AutoFadeDeactivate
****************************************************************************//**
*
* Configures the mixer source to automatically deactivate when "fade out"
* completes
*
* \param base pointer to the Mixer SRC Struct instance
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_AutoFadeDeactivate(volatile MIXER_SRC_STRUCT_Type * base)
{
    MIXER_SRC_STRUCT_SRC_FADE_CMD(base) |= MIXER_MIXER_SRC_STRUCT_SRC_FADE_CMD_AUTO_DEACTIVATE_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_FadePaceSelect
****************************************************************************//**
*
* Specifies the pace/speed of source "fade in" and "fade out"
*
* \param base pointer to the Mixer SRC Struct instance
* \param pace (10-bit value)
*          "0": The same CODE value is used (0+1) times,
*          "1": The same CODE value is used (1+1) times.
*          ...
*          "1023": The same CODE value is used (1023+1) times.
*           A fade in from "mute" to 0 dB takes 1024*116 = 118,784 PCM samples. At a PCM sample frequency
*           Fs of 48 kHz, this translates into 118,784/48,000 = 2.474 seconds.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_FadePaceSelect(volatile MIXER_SRC_STRUCT_Type * base, uint16_t pace)
{
    CY_REG32_CLR_SET(MIXER_SRC_STRUCT_SRC_FADE_CMD(base), MIXER_MIXER_SRC_STRUCT_SRC_FADE_CMD_PACE, pace);
}

