RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/*******************************************************************************
* Function Name: Cy_Mixer_Src_GainCodeSelect
****************************************************************************//**
*
* Set the source gain code in the range [0, 127].
* Each gain code increment represents 1 dB.
* Gain code value "0" represents digital mute.
* Gain code "127" represents a maximum amplification of 12 dB.
*
* \param base pointer to the Mixer SRC Struct instance
* \param code (7-bit value)
*            "0": digital mute. Multiplier value is "0" and "shift" is "26".
*            "1": -114 dB. Multiplier value is "134" and "shift" is "26".
*            "2": -113 dB. Multiplier value is "150" and "shift" is "26".
*            "3": -112 dB. Multiplier value is "169" and "shift" is "26".
*            ...
*            "115": 0 dB. Multiplier value is "4096" and "shift" is "12". Note that (4096 * x) >> 12 = x; i.e. the PCM value is unaffected.
*            ...
*            "121": 6 dB. Multiplier value is "8173" and "shift" is "12".
*            ...
*            "127": 12 dB. Multiplier value is "8153" and "shift" is "11".
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_GainCodeSelect(volatile MIXER_SRC_STRUCT_Type * base, uint8_t code)
{
    MIXER_SRC_STRUCT_SRC_GAIN_CTL(base) = _VAL2FLD(MIXER_MIXER_SRC_STRUCT_SRC_GAIN_CTL_CODE, code);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_FifoTriggerLevel
****************************************************************************//**
*
* Set the source FIFO trigger level.
* When the source FIFO has fewer entries than the number of this field,
* a transmitter trigger event is generated.
*
* \param base pointer to the Mixer SRC Struct instance
* \param level (7-bit value) (INTR_SRC.FIFO_TRIGGER = (# FIFO entries < TRIGGER_LEVEL))
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_FifoTriggerLevel(volatile MIXER_SRC_STRUCT_Type * base, uint8_t level)
{
    CY_REG32_CLR_SET(MIXER_SRC_STRUCT_SRC_FIFO_CTL(base), MIXER_MIXER_SRC_STRUCT_SRC_FIFO_CTL_TRIGGER_LEVEL, level);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_Mute
****************************************************************************//**
*
* Mute the mixer source
*
* \param base pointer to the Mixer SRC Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Src_Mute
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_Mute(volatile MIXER_SRC_STRUCT_Type * base)
{
    MIXER_SRC_STRUCT_SRC_FIFO_CTL(base) |= MIXER_MIXER_SRC_STRUCT_SRC_FIFO_CTL_MUTE_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_Unmute
****************************************************************************//**
*
* Unmute the mixer source
*
* \param base pointer to the Mixer SRC Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Src_Unmute
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_Unmute(volatile MIXER_SRC_STRUCT_Type * base)
{
    MIXER_SRC_STRUCT_SRC_FIFO_CTL(base) &= ~MIXER_MIXER_SRC_STRUCT_SRC_FIFO_CTL_MUTE_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_Activate
****************************************************************************//**
*
* Activate the mixer source
*
* \param base pointer to the Mixer SRC Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_SourceInit
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_Activate(volatile MIXER_SRC_STRUCT_Type * base)
{
    MIXER_SRC_STRUCT_SRC_FIFO_CTL(base) |= MIXER_MIXER_SRC_STRUCT_SRC_FIFO_CTL_ACTIVE_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_Deactivate
****************************************************************************//**
*
* Deactivate the mixer source
*
* \param base pointer to the Mixer SRC Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Src_Disable
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_Deactivate(volatile MIXER_SRC_STRUCT_Type * base)
{
    MIXER_SRC_STRUCT_SRC_FIFO_CTL(base) &= ~MIXER_MIXER_SRC_STRUCT_SRC_FIFO_CTL_ACTIVE_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_GetUsedFifoEntries
****************************************************************************//**
*
* Get the number of used/occupied entries in the source FIFO.
* The field value is in the range [0, 128]. When "0", the FIFO is empty. When "128", the FIFO is full.
*
* \param base pointer to the Mixer SRC Struct instance
*
* \return uint8_t number of used/occupied entries in the source FIFO
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Mixer_Src_GetUsedFifoEntries(volatile MIXER_SRC_STRUCT_Type * base)
{
    return (uint8_t)(_FLD2VAL(MIXER_MIXER_SRC_STRUCT_SRC_FIFO_STATUS_USED, MIXER_SRC_STRUCT_SRC_FIFO_STATUS(base)));
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_GetFifoReadPtr
****************************************************************************//**
*
* Get the source FIFO read pointer (Source FIFO location from which a data is read).
*
* \param base pointer to the Mixer SRC Struct instance
*
* \return uint8_t read pointer value
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Mixer_Src_GetFifoReadPtr(volatile MIXER_SRC_STRUCT_Type * base)
{
    return (uint8_t)(_FLD2VAL(MIXER_MIXER_SRC_STRUCT_SRC_FIFO_STATUS_RD_PTR, MIXER_SRC_STRUCT_SRC_FIFO_STATUS(base)));
}

