RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/*******************************************************************************
* Function Name: Cy_Mixer_Src_GetFifoWritePtr
****************************************************************************//**
*
* Get the source FIFO write pointer (Source FIFO location at which new
* data is written by the hardware).
*
* \param base pointer to the Mixer SRC Struct instance
*
* \return uint8_t write pointer value
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Mixer_Src_GetFifoWritePtr(volatile MIXER_SRC_STRUCT_Type * base)
{
    return (uint8_t)(_FLD2VAL(MIXER_MIXER_SRC_STRUCT_SRC_FIFO_STATUS_WR_PTR, MIXER_SRC_STRUCT_SRC_FIFO_STATUS(base)));
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_FifoWriteData
****************************************************************************//**
*
* Data (PCM sample pair of two 16-bit samples) written to the top source FIFO
* entry (data[31:0] = DATA[31:0]). Typically, DATA[15:0] is used for channel 0
* and DATA[31:16] is used for channel 1. Writing adds the data to the source
* FIFO; i.e. behavior is similar to that of a PUSH operation.
*
* \param base pointer to the Mixer SRC Struct instance
* \param data 32-bit data
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Src_FifoWriteData
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_FifoWriteData(volatile MIXER_SRC_STRUCT_Type * base, uint32_t data)
{
    MIXER_SRC_STRUCT_SRC_FIFO_WR(base) = data;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_ClearInterrupt
****************************************************************************//**
*
* Source interrupt clear (HW sets and SW clears)
*
* \param base pointer to the Mixer SRC Struct instance
* \param intSrc \ref cy_en_mixer_src_interrupt_t
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Src_ClearInterrupt
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_ClearInterrupt(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_src_interrupt_t intSrc)
{
    switch (intSrc)
    {
    case CY_MIXER_SRC_FIFO_TRIGGER:
        /* HW sets this field to '1', when a source trigger is generated. */
        MIXER_SRC_STRUCT_INTR_SRC(base) = MIXER_MIXER_SRC_STRUCT_INTR_SRC_FIFO_TRIGGER_Msk;
        break;
    case CY_MIXER_SRC_FIFO_OVERFLOW:
        /* HW sets this field to '1', when writing to a full source FIFO (SRC_FIFO_STATUS.USED is "128"). */
        MIXER_SRC_STRUCT_INTR_SRC(base) = MIXER_MIXER_SRC_STRUCT_INTR_SRC_FIFO_OVERFLOW_Msk;
        break;
    case CY_MIXER_SRC_FADE_OUT:
        /* HW sets this field to '1', when fade out has completed (HW changes SRC_FADE_CMD.FADE_OUT from "0" to "1"). */
        MIXER_SRC_STRUCT_INTR_SRC(base) = MIXER_MIXER_SRC_STRUCT_INTR_SRC_FADED_OUT_Msk;
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_SetInterrupt
****************************************************************************//**
*
* Source interrupt set (Write this field with '1' to set corresponding INTR_SRC field)
*
* \param base pointer to the Mixer SRC Struct instance
* \param intSrc \ref cy_en_mixer_src_interrupt_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_SetInterrupt(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_src_interrupt_t intSrc)
{
    switch (intSrc)
    {
    case CY_MIXER_SRC_FIFO_TRIGGER:
        MIXER_SRC_STRUCT_INTR_SRC_SET(base) = MIXER_MIXER_SRC_STRUCT_INTR_SRC_SET_FIFO_TRIGGER_Msk;
        break;
    case CY_MIXER_SRC_FIFO_OVERFLOW:
        MIXER_SRC_STRUCT_INTR_SRC_SET(base) = MIXER_MIXER_SRC_STRUCT_INTR_SRC_SET_FIFO_OVERFLOW_Msk;
        break;
    case CY_MIXER_SRC_FADE_OUT:
        MIXER_SRC_STRUCT_INTR_SRC_SET(base) = MIXER_MIXER_SRC_STRUCT_INTR_SRC_SET_FADED_OUT_Msk;
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_ClearInterruptMask
****************************************************************************//**
*
* Source interrupt clear Mask for corresponding field in INTR_SRC register.
*
* \param base pointer to the Mixer SRC Struct instance
* \param intSrc \ref cy_en_mixer_src_interrupt_t
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Src_SetInterruptMask
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_ClearInterruptMask(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_src_interrupt_t intSrc)
{
    switch (intSrc)
    {
    case CY_MIXER_SRC_FIFO_TRIGGER:
        MIXER_SRC_STRUCT_INTR_SRC_MASK(base) &= ~MIXER_MIXER_SRC_STRUCT_INTR_SRC_MASK_FIFO_TRIGGER_Msk;
        break;
    case CY_MIXER_SRC_FIFO_OVERFLOW:
        MIXER_SRC_STRUCT_INTR_SRC_MASK(base) &= ~MIXER_MIXER_SRC_STRUCT_INTR_SRC_MASK_FIFO_OVERFLOW_Msk;
        break;
    case CY_MIXER_SRC_FADE_OUT:
        MIXER_SRC_STRUCT_INTR_SRC_MASK(base) &= ~MIXER_MIXER_SRC_STRUCT_INTR_SRC_MASK_FADED_OUT_Msk;
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Src_SetInterruptMask
****************************************************************************//**
*
* Source interrupt set Mask for corresponding field in INTR_SRC register.
*
* \param base pointer to the Mixer SRC Struct instance
* \param intSrc \ref cy_en_mixer_src_interrupt_t
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Src_SetInterruptMask
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Src_SetInterruptMask(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_src_interrupt_t intSrc)
{
    switch (intSrc)
    {
    case CY_MIXER_SRC_FIFO_TRIGGER:
        MIXER_SRC_STRUCT_INTR_SRC_MASK(base) |= MIXER_MIXER_SRC_STRUCT_INTR_SRC_MASK_FIFO_TRIGGER_Msk;
        break;
    case CY_MIXER_SRC_FIFO_OVERFLOW:
        MIXER_SRC_STRUCT_INTR_SRC_MASK(base) |= MIXER_MIXER_SRC_STRUCT_INTR_SRC_MASK_FIFO_OVERFLOW_Msk;
        break;
    case CY_MIXER_SRC_FADE_OUT:
        MIXER_SRC_STRUCT_INTR_SRC_MASK(base) |= MIXER_MIXER_SRC_STRUCT_INTR_SRC_MASK_FADED_OUT_Msk;
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }
}

