RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/*******************************************************************************
* Function Name: Cy_Mixer_Src_IsInterruptActive
****************************************************************************//**
*
* Get source interrupt active state.
*
* \param base pointer to the Mixer SRC Struct instance
* \param intSrc \ref cy_en_mixer_src_interrupt_t
*
* \return
* true: interrupt is set
* false: interrupt is not set
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Src_ClearInterrupt
*
*******************************************************************************/
__STATIC_INLINE bool Cy_Mixer_Src_IsInterruptActive(volatile MIXER_SRC_STRUCT_Type * base, cy_en_mixer_src_interrupt_t intSrc)
{
    bool intActive = false;
    switch (intSrc)
    {
    case CY_MIXER_SRC_FIFO_TRIGGER:
        intActive = (0UL != (MIXER_SRC_STRUCT_INTR_SRC(base) & MIXER_MIXER_SRC_STRUCT_INTR_SRC_FIFO_TRIGGER_Msk));
        break;
    case CY_MIXER_SRC_FIFO_OVERFLOW:
        intActive = (0UL != (MIXER_SRC_STRUCT_INTR_SRC(base) & MIXER_MIXER_SRC_STRUCT_INTR_SRC_FIFO_OVERFLOW_Msk));
        break;
    case CY_MIXER_SRC_FADE_OUT:
        intActive = (0UL != (MIXER_SRC_STRUCT_INTR_SRC(base) & MIXER_MIXER_SRC_STRUCT_INTR_SRC_FADED_OUT_Msk));
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }

    return intActive;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_Enable
****************************************************************************//**
*
* Mixer destination enable
*
* \param base pointer to the Mixer DST Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_DestinationInit
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_Enable(volatile MIXER_DST_STRUCT_Type * base)
{
    MIXER_DST_STRUCT_DST_CTL(base) = MIXER_MIXER_DST_STRUCT_DST_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_Disable
****************************************************************************//**
*
* Mixer destination disable
*
* \param base pointer to the Mixer DST Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_Disable
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_Disable(volatile MIXER_DST_STRUCT_Type * base)
{
    MIXER_DST_STRUCT_DST_CTL(base) = 0UL;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_FadeControl
****************************************************************************//**
*
* Set the destination fade control (Gain code in the range [0, 115])
*
* \param base pointer to the Mixer DST Struct instance
* \param fadeCode \ref cy_en_mixer_fade_code_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_FadeControl(volatile MIXER_DST_STRUCT_Type * base, cy_en_mixer_fade_code_t fadeCode)
{
    MIXER_DST_STRUCT_DST_FADE_CTL(base) = _VAL2FLD(MIXER_MIXER_DST_STRUCT_DST_FADE_CTL_CODE, fadeCode);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_GetCurrentPace
****************************************************************************//**
*
* Get the Destination fading pace counter value.
* DST_FADE_CTL.PACE value of "n" reuses a specific fade value "n+1" times.
*
* \param base pointer to the Mixer DST Struct instance
*
* \return uint16_t fading pace counter value
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_Mixer_Dst_GetCurrentPace(volatile MIXER_DST_STRUCT_Type * base)
{
    return (uint8_t)(_FLD2VAL(MIXER_MIXER_DST_STRUCT_DST_FADE_STATUS_PACE, MIXER_DST_STRUCT_DST_FADE_STATUS(base)));
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_FadeInEnable
****************************************************************************//**
*
* Mixer destination fade in enable
*
* (SW sets this field to '1' to start "fade in" functionality. HW clears this
* field to '0' to indicate that "fade in" has completed) FADE_IN and FADE_OUT
* should be used mutually exclusively. However, if "fade in" is desired while
* "fading out", SW can set FADE_IN to '1' and clear FADE_OUT to '0'. "Fade in"
* will commence from the current CODE value. Similarly,  if "fade out" is
* desired while "fading in", SW can set FADE_OUT to '1' and clear FADE_IN to
* '0'. "Fade out" will commence from the current CODE value.
*
* \param base pointer to the Mixer DST Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_FadeInEnable
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_FadeInEnable(volatile MIXER_DST_STRUCT_Type * base)
{
    MIXER_DST_STRUCT_DST_FADE_CMD(base) |= MIXER_MIXER_DST_STRUCT_DST_FADE_CMD_FADE_IN_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_FadeInDisable
****************************************************************************//**
*
* Mixer destination fade in disable
*
* \param base pointer to the Mixer DST Struct instance
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_FadeInDisable(volatile MIXER_DST_STRUCT_Type * base)
{
    MIXER_DST_STRUCT_DST_FADE_CMD(base) &= ~MIXER_MIXER_DST_STRUCT_DST_FADE_CMD_FADE_IN_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_FadeOutEnable
****************************************************************************//**
*
* Mixer destination fade out enable
*
* \param base pointer to the Mixer DST Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_FadeOutEnable
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_FadeOutEnable(volatile MIXER_DST_STRUCT_Type * base)
{
    MIXER_DST_STRUCT_DST_FADE_CMD(base) |= MIXER_MIXER_DST_STRUCT_DST_FADE_CMD_FADE_OUT_Msk;
}

