RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/*******************************************************************************
* Function Name: Cy_Mixer_Dst_FadeOutDisable
****************************************************************************//**
*
* Mixer destination fade out disable
*
* \param base pointer to the Mixer DST Struct instance
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_FadeOutDisable(volatile MIXER_DST_STRUCT_Type * base)
{
    MIXER_DST_STRUCT_DST_FADE_CMD(base) &= ~MIXER_MIXER_DST_STRUCT_DST_FADE_CMD_FADE_OUT_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_AutoFadeActivate
****************************************************************************//**
*
* Configures the mixer destination to NOT deactivate when "fade out" completes
*
* \param base pointer to the Mixer DST Struct instance
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_AutoFadeActivate(volatile MIXER_DST_STRUCT_Type * base)
{
    MIXER_DST_STRUCT_DST_FADE_CMD(base) &= ~MIXER_MIXER_DST_STRUCT_DST_FADE_CMD_AUTO_DEACTIVATE_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_AutoFadeDeactivate
****************************************************************************//**
*
* Configures the mixer destination to automatically deactivate when "fade out"
* completes
*
* \param base pointer to the Mixer DST Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_FadeOutEnable
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_AutoFadeDeactivate(volatile MIXER_DST_STRUCT_Type * base)
{
    MIXER_DST_STRUCT_DST_FADE_CMD(base) |= MIXER_MIXER_DST_STRUCT_DST_FADE_CMD_AUTO_DEACTIVATE_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_FadePaceSelect
****************************************************************************//**
*
* Destination fade pace select (Specifies the pace/speed of "fade in" and "fade out")
*
* \param base pointer to the Mixer DST Struct instance
* \param pace (10-bit value)
*          "0": The same CODE value is used (0+1) times,
*          "1": The same CODE value is used (1+1) times.
*          ...
*          "1023": The same CODE value is used (1023+1) times.
*           A fade in from "mute" to 0 dB takes 1024*116 = 118,784 PCM samples. At a PCM sample frequency
*           Fs of 48 kHz, this translates into 118,784/48,000 = 2.474 seconds.
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_FadeInEnable
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_FadePaceSelect(volatile MIXER_DST_STRUCT_Type * base, uint16_t pace)
{
    CY_REG32_CLR_SET(MIXER_DST_STRUCT_DST_FADE_CMD(base), MIXER_MIXER_DST_STRUCT_DST_FADE_CMD_PACE, pace);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_GainCodeSelect
****************************************************************************//**
*
* Set the destination gain code in the range [0, 127].
* Each gain code increment represents 1 dB. Gain code value "0" represents
* digital mute. Gain code "127" represents a maximum amplification of 12 dB.
*
* \param base pointer to the Mixer DST Struct instance
* \param code (7-bit value)
*          "0": digital mute. Multiplier value is "0" and "shift" is "26".
*          "1": -114 dB. Multiplier value is "134" and "shift" is "26".
*          "2": -113 dB. Multiplier value is "150" and "shift" is "26".
*          "3": -112 dB. Multiplier value is "169" and "shift" is "26".
*          ...
*          "115": 0 dB. Multiplier value is "4096" and "shift" is "12". Note that (4096 * x) >> 12 = x; i.e. the PCM value is unaffected.
*          ...
*          "121": 6 dB. Multiplier value is "8173" and "shift" is "12".
*          ...
*          "127": 12 dB. Multiplier value is "8153" and "shift" is "11".
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_GainCodeSelect(volatile MIXER_DST_STRUCT_Type * base, uint8_t code)
{
    MIXER_DST_STRUCT_DST_GAIN_CTL(base) = _VAL2FLD(MIXER_MIXER_DST_STRUCT_DST_GAIN_CTL_CODE, code);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_FifoTriggerLevel
****************************************************************************//**
*
* Destination FIFO trigger level. When the destination FIFO has more entries
* than the number of this field, a transmitter trigger event is generated.
*
* \param base pointer to the Mixer DST Struct instance
* \param level (6-bit value) (INTR_SRC.FIFO_TRIGGER = (# FIFO entries > TRIGGER_LEVEL))
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_FifoTriggerLevel(volatile MIXER_DST_STRUCT_Type * base, uint8_t level)
{
    CY_REG32_CLR_SET(MIXER_DST_STRUCT_DST_FIFO_CTL(base), MIXER_MIXER_DST_STRUCT_DST_FIFO_CTL_TRIGGER_LEVEL, level);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_Mute
****************************************************************************//**
*
* Mixer destination mute
*
* \param base pointer to the Mixer DST Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_Mute
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_Mute(volatile MIXER_DST_STRUCT_Type * base)
{
    MIXER_DST_STRUCT_DST_FIFO_CTL(base) |= MIXER_MIXER_DST_STRUCT_DST_FIFO_CTL_MUTE_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_Unmute
****************************************************************************//**
*
* Mixer destination unmute
*
* \param base pointer to the Mixer DST Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_Unmute
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_Unmute(volatile MIXER_DST_STRUCT_Type * base)
{
    MIXER_DST_STRUCT_DST_FIFO_CTL(base) &= ~MIXER_MIXER_DST_STRUCT_DST_FIFO_CTL_MUTE_Msk;
}

