RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/*******************************************************************************
* Function Name: Cy_Mixer_Dst_Activate
****************************************************************************//**
*
* Activate the mixer destination
*
* \param base pointer to the Mixer DST Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_DestinationInit
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_Activate(volatile MIXER_DST_STRUCT_Type * base)
{
    MIXER_DST_STRUCT_DST_FIFO_CTL(base) |= MIXER_MIXER_DST_STRUCT_DST_FIFO_CTL_ACTIVE_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_Deactivate
****************************************************************************//**
*
* Deactivate the mixer destination
*
* \param base pointer to the Mixer DST Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_Disable
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_Deactivate(volatile MIXER_DST_STRUCT_Type * base)
{
    MIXER_DST_STRUCT_DST_FIFO_CTL(base) &= ~MIXER_MIXER_DST_STRUCT_DST_FIFO_CTL_ACTIVE_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_GetUsedFifoEntries
****************************************************************************//**
*
* Number of used/occupied entries in the destination FIFO.
* The field value is in the range [0, 128]. When "0", the FIFO is empty.
* When "128", the FIFO is full.
*
* \param base pointer to the Mixer DST Struct instance
*
* \return uint8_t number of used/occupied entries in the destination FIFO
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Mixer_Dst_GetUsedFifoEntries(volatile MIXER_DST_STRUCT_Type * base)
{
    return (uint8_t)(_FLD2VAL(MIXER_MIXER_DST_STRUCT_DST_FIFO_STATUS_USED, MIXER_DST_STRUCT_DST_FIFO_STATUS(base)));
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_GetFifoReadPtr
****************************************************************************//**
*
* Get the destination FIFO read pointer (Destination FIFO location from which a data is read).
*
* \param base pointer to the Mixer DST Struct instance
*
* \return uint8_t read pointer value
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Mixer_Dst_GetFifoReadPtr(volatile MIXER_DST_STRUCT_Type * base)
{
    return (uint8_t)(_FLD2VAL(MIXER_MIXER_DST_STRUCT_DST_FIFO_STATUS_RD_PTR, MIXER_DST_STRUCT_DST_FIFO_STATUS(base)));
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_GetFifoWritePtr
****************************************************************************//**
*
* Get the destination FIFO write pointer (Destination FIFO location at which
* new data is written by the hardware).
*
* \param base pointer to the Mixer DST Struct instance
*
* \return uint8_t write pointer value
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Mixer_Dst_GetFifoWritePtr(volatile MIXER_DST_STRUCT_Type * base)
{
    return (uint8_t)(_FLD2VAL(MIXER_MIXER_DST_STRUCT_DST_FIFO_STATUS_WR_PTR, MIXER_DST_STRUCT_DST_FIFO_STATUS(base)));
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_FifoReadData
****************************************************************************//**
*
* Read data (PCM sample pair of two 16-bit samples) at the top destination
* FIFO entry (data[31:0] = DATA[31:0]). Reading removes the data from the
* destination FIFO; i.e. behavior is similar to that of a POP operation
* (DST_FIFO_STATUS.RD_PTR is incremented and DST_FIFO_STATUS.USED is decremented).
*
* \param base pointer to the Mixer DST Struct instance
*
* \return uint32_t FIFO data sample
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_FifoReadData
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_Mixer_Dst_FifoReadData(volatile MIXER_DST_STRUCT_Type * base)
{
    return MIXER_DST_STRUCT_DST_FIFO_RD(base);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_ClearInterrupt
****************************************************************************//**
*
* Destination interrupt clear (HW sets and SW clears)
*
* \param base pointer to the Mixer DST Struct instance
* \param intSrc \ref cy_en_mixer_dst_interrupt_t
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_ClearInterrupt
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_ClearInterrupt(volatile MIXER_DST_STRUCT_Type * base, cy_en_mixer_dst_interrupt_t intSrc)
{
    switch (intSrc)
    {
    case CY_MIXER_DST_FIFO_TRIGGER:
        MIXER_DST_STRUCT_INTR_DST(base) = MIXER_MIXER_DST_STRUCT_INTR_DST_FIFO_TRIGGER_Msk;
        break;
    case CY_MIXER_DST_FIFO_UNDERFLOW:
        MIXER_DST_STRUCT_INTR_DST(base) = MIXER_MIXER_DST_STRUCT_INTR_DST_FIFO_UNDERFLOW_Msk;
        break;
    case CY_MIXER_DST_FADE_OUT:
        MIXER_DST_STRUCT_INTR_DST(base) = MIXER_MIXER_DST_STRUCT_INTR_DST_FADED_OUT_Msk;
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_SetInterrupt
****************************************************************************//**
*
* Destination interrupt set (Write this field with '1' to set corresponding INTR_DST field)
*
* \param base pointer to the Mixer DST Struct instance
* \param intSrc \ref cy_en_mixer_dst_interrupt_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_SetInterrupt(volatile MIXER_DST_STRUCT_Type * base, cy_en_mixer_dst_interrupt_t intSrc)
{
    switch (intSrc)
    {
    case CY_MIXER_DST_FIFO_TRIGGER:
        MIXER_DST_STRUCT_INTR_DST_SET(base) = MIXER_MIXER_DST_STRUCT_INTR_DST_SET_FIFO_TRIGGER_Msk;
        break;
    case CY_MIXER_DST_FIFO_UNDERFLOW:
        MIXER_DST_STRUCT_INTR_DST_SET(base) = MIXER_MIXER_DST_STRUCT_INTR_DST_SET_FIFO_UNDERFLOW_Msk;
        break;
    case CY_MIXER_DST_FADE_OUT:
        MIXER_DST_STRUCT_INTR_DST_SET(base) = MIXER_MIXER_DST_STRUCT_INTR_DST_SET_FADED_OUT_Msk;
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }
}

