RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/*******************************************************************************
* Function Name: Cy_Mixer_Dst_ClearInterruptMask
****************************************************************************//**
*
* Destination interrupt clear Mask for corresponding field in INTR_DST register.
*
* \param base pointer to the Mixer DST Struct instance
* \param intSrc \ref cy_en_mixer_dst_interrupt_t
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_SetInterruptMask
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_ClearInterruptMask(volatile MIXER_DST_STRUCT_Type * base, cy_en_mixer_dst_interrupt_t intSrc)
{
    switch (intSrc)
    {
    case CY_MIXER_DST_FIFO_TRIGGER:
        MIXER_DST_STRUCT_INTR_DST_MASK(base) &= ~MIXER_MIXER_DST_STRUCT_INTR_DST_MASK_FIFO_TRIGGER_Msk;
        break;
    case CY_MIXER_DST_FIFO_UNDERFLOW:
        MIXER_DST_STRUCT_INTR_DST_MASK(base) &= ~MIXER_MIXER_DST_STRUCT_INTR_DST_MASK_FIFO_UNDERFLOW_Msk;
        break;
    case CY_MIXER_DST_FADE_OUT:
        MIXER_DST_STRUCT_INTR_DST_MASK(base) &= ~MIXER_MIXER_DST_STRUCT_INTR_DST_MASK_FADED_OUT_Msk;
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_SetInterruptMask
****************************************************************************//**
*
* Destination interrupt set Mask for corresponding field in INTR_DST register.
*
* \param base pointer to the Mixer DST Struct instance
* \param intSrc \ref cy_en_mixer_dst_interrupt_t
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_SetInterruptMask
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Dst_SetInterruptMask(volatile MIXER_DST_STRUCT_Type * base, cy_en_mixer_dst_interrupt_t intSrc)
{
    switch (intSrc)
    {
    case CY_MIXER_DST_FIFO_TRIGGER:
        MIXER_DST_STRUCT_INTR_DST_MASK(base) |= MIXER_MIXER_DST_STRUCT_INTR_DST_MASK_FIFO_TRIGGER_Msk;
        break;
    case CY_MIXER_DST_FIFO_UNDERFLOW:
        MIXER_DST_STRUCT_INTR_DST_MASK(base) |= MIXER_MIXER_DST_STRUCT_INTR_DST_MASK_FIFO_UNDERFLOW_Msk;
        break;
    case CY_MIXER_DST_FADE_OUT:
        MIXER_DST_STRUCT_INTR_DST_MASK(base) |= MIXER_MIXER_DST_STRUCT_INTR_DST_MASK_FADED_OUT_Msk;
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Dst_IsInterruptActive
****************************************************************************//**
*
* Get destination interrupt active state.
*
* \param base pointer to the Mixer DST Struct instance
* \param intSrc \ref cy_en_mixer_dst_interrupt_t
*
* \return
* true: interrupt is set
* false: interrupt is not set
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Dst_ClearInterrupt
*
*******************************************************************************/
__STATIC_INLINE bool Cy_Mixer_Dst_IsInterruptActive(volatile MIXER_DST_STRUCT_Type * base, cy_en_mixer_dst_interrupt_t intSrc)
{
    bool intActive = false;

    switch (intSrc)
    {
    case CY_MIXER_DST_FIFO_TRIGGER:
        intActive = (0UL != (MIXER_DST_STRUCT_INTR_DST(base) & MIXER_MIXER_DST_STRUCT_INTR_DST_FIFO_TRIGGER_Msk));
        break;
    case CY_MIXER_DST_FIFO_UNDERFLOW:
        intActive = (0UL != (MIXER_DST_STRUCT_INTR_DST(base) & MIXER_MIXER_DST_STRUCT_INTR_DST_FIFO_UNDERFLOW_Msk));
        break;
    case CY_MIXER_DST_FADE_OUT:
        intActive = (0UL != (MIXER_DST_STRUCT_INTR_DST(base) & MIXER_MIXER_DST_STRUCT_INTR_DST_FADED_OUT_Msk));
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }

    return intActive;
}

#if (defined(MIXER0_TX_PRESENT) && (MIXER0_TX_PRESENT == 1)) || (defined(MIXER1_TX_PRESENT) && (MIXER1_TX_PRESENT == 1))
/*******************************************************************************
* Function Name: Cy_Mixer_Tx_Enable
****************************************************************************//**
*
* Enable the Mixer Transmitter
*
* \param base pointer to the Mixer TX Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_TransmitInit
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_Enable(volatile MIXER_TX_STRUCT_Type * base)
{
    MIXER_TX_STRUCT_TX_CTL(base) |= MIXER_MIXER_TX_STRUCT_TX_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_Disable
****************************************************************************//**
*
* Disable the Mixer Transmitter
*
* \param base pointer to the Mixer TX Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Tx_Disable
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_Disable(volatile MIXER_TX_STRUCT_Type * base)
{
    MIXER_TX_STRUCT_TX_CTL(base) &= ~MIXER_MIXER_TX_STRUCT_TX_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_WordSize
****************************************************************************//**
*
* Set the Mixer Transmitter word size
*
* \param base pointer to the Mixer TX Struct instance
* \param wdSize \ref cy_en_mixer_tx_wd_size_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_WordSize(volatile MIXER_TX_STRUCT_Type * base, cy_en_mixer_tx_wd_size_t wdSize)
{
    CY_REG32_CLR_SET(MIXER_TX_STRUCT_TX_CTL(base), MIXER_MIXER_TX_STRUCT_TX_CTL_WORD_SIZE, wdSize);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_Format
****************************************************************************//**
*
* Set the Mixer Transmitter I2S format
*
* \param base pointer to the Mixer TX Struct instance
* \param format \ref cy_en_mixer_tx_fmt_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_Format(volatile MIXER_TX_STRUCT_Type * base, cy_en_mixer_tx_fmt_t format)
{
    CY_REG32_CLR_SET(MIXER_TX_STRUCT_TX_CTL(base), MIXER_MIXER_TX_STRUCT_TX_CTL_FORMAT, format);
}

