RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/*******************************************************************************
* Function Name: Cy_Mixer_Tx_SelectMode
****************************************************************************//**
*
* Set the Mixer Transmitter Mode
*
* \param base pointer to the Mixer TX Struct instance
* \param mode \ref cy_en_mixer_tx_mode_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_SelectMode(volatile MIXER_TX_STRUCT_Type * base, cy_en_mixer_tx_mode_t mode)
{
    CY_REG32_CLR_SET(MIXER_TX_STRUCT_TX_CTL(base), MIXER_MIXER_TX_STRUCT_TX_CTL_MS, mode);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_ClockDivider
****************************************************************************//**
*
* Select the Mixer Transmitter Clock divider
*
* \param base pointer to the Mixer TX Struct instance
* \param clkDiv divider value [1...255] 0->DIV_BY_1, 255->DIV_BY_256
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_ClockDivider(volatile MIXER_TX_STRUCT_Type * base, uint8_t clkDiv)
{
    CY_REG32_CLR_SET(MIXER_TX_STRUCT_TX_IF_CTL(base), MIXER_MIXER_TX_STRUCT_TX_IF_CTL_CLOCK_DIV, clkDiv);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_ClockSelect
****************************************************************************//**
*
* Select the Mixer Transmitter Clock
*
* \param base pointer to the Mixer TX Struct instance
* \param clkSel \ref cy_en_mixer_tx_clk_sel_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_ClockSelect(volatile MIXER_TX_STRUCT_Type * base, cy_en_mixer_tx_clk_sel_t clkSel)
{
    CY_REG32_CLR_SET(MIXER_TX_STRUCT_TX_IF_CTL(base), MIXER_MIXER_TX_STRUCT_TX_IF_CTL_CLOCK_SEL, clkSel);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_ClockPolarity
****************************************************************************//**
*
* Sets the Mixer transmitter clock polarity
*
* \param base pointer to the Mixer TX Struct instance
* \param polarity
* false = Clock signal is used "as is" \n
* true = Clock signal is inverted
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_ClockPolarity(volatile MIXER_TX_STRUCT_Type * base, bool polarity)
{
    if (polarity)
    {
        MIXER_TX_STRUCT_TX_IF_CTL(base) |= MIXER_MIXER_TX_STRUCT_TX_IF_CTL_SCK_POLARITY_Msk;
    }
    else
    {
        MIXER_TX_STRUCT_TX_IF_CTL(base) &= ~MIXER_MIXER_TX_STRUCT_TX_IF_CTL_SCK_POLARITY_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_WordSelectPolarity
****************************************************************************//**
*
* Sets the Mixer transmitter word select polarity
*
* \param base pointer to the Mixer TX Struct instance
* \param polarity
* false = Word select signal is used "as is" \n
* true = Word select signal is inverted
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_WordSelectPolarity(volatile MIXER_TX_STRUCT_Type * base, bool polarity)
{
    if (polarity)
    {
        MIXER_TX_STRUCT_TX_IF_CTL(base) |= MIXER_MIXER_TX_STRUCT_TX_IF_CTL_WS_POLARITY_Msk;
    }
    else
    {
        MIXER_TX_STRUCT_TX_IF_CTL(base) &= ~MIXER_MIXER_TX_STRUCT_TX_IF_CTL_WS_POLARITY_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_ChannelEnable
****************************************************************************//**
*
* Enables the selected Mixer channel
*
* \param base pointer to the Mixer TX Struct instance
* \param channel \ref cy_en_mixer_channel_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_ChannelEnable(volatile MIXER_TX_STRUCT_Type * base, cy_en_mixer_channel_t channel)
{
    if (channel == CY_MIXER_CHANNEL0)
    {
        MIXER_TX_STRUCT_TX_IF_CTL(base) |= MIXER_MIXER_TX_STRUCT_TX_IF_CTL_CH0_EN_Msk;
    }
    else /* (channel == CY_MIXER_CHANNEL1) */
    {
        MIXER_TX_STRUCT_TX_IF_CTL(base) |= MIXER_MIXER_TX_STRUCT_TX_IF_CTL_CH1_EN_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_ChannelDisable
****************************************************************************//**
*
* Disables the selected Mixer channel
*
* \param base pointer to the Mixer TX Struct instance
* \param channel \ref cy_en_mixer_channel_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_ChannelDisable(volatile MIXER_TX_STRUCT_Type * base, cy_en_mixer_channel_t channel)
{
    if (channel == CY_MIXER_CHANNEL0)
    {
        MIXER_TX_STRUCT_TX_IF_CTL(base) &= ~MIXER_MIXER_TX_STRUCT_TX_IF_CTL_CH0_EN_Msk;
    }
    else /* (channel == CY_MIXER_CHANNEL1) */
    {
        MIXER_TX_STRUCT_TX_IF_CTL(base) &= ~MIXER_MIXER_TX_STRUCT_TX_IF_CTL_CH1_EN_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_ChannelSize
****************************************************************************//**
*
* Set the Mixer Transmitter Channel Size
*
* \param base pointer to the Mixer TX Struct instance
* \param chSize divider value [1...31] 0->SIZE_1, 31->SIZE_32
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_ChannelSize(volatile MIXER_TX_STRUCT_Type * base, uint8_t chSize)
{
    CY_REG32_CLR_SET(MIXER_TX_STRUCT_TX_IF_CTL(base), MIXER_MIXER_TX_STRUCT_TX_IF_CTL_CH_SIZE, chSize);
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_Mute
****************************************************************************//**
*
* Mixer transmitter mute (HW uses a constant PCM data value of "0". Mute does advance the FIFO read pointer.)
*
* \param base pointer to the Mixer TX Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Tx_Mute
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_Mute(volatile MIXER_TX_STRUCT_Type * base)
{
    MIXER_TX_STRUCT_TX_FIFO_CTL(base) |= MIXER_MIXER_TX_STRUCT_TX_FIFO_CTL_MUTE_Msk;
}

