RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/*******************************************************************************
* Function Name: Cy_Mixer_Tx_Unmute
****************************************************************************//**
*
* Mixer transmitter unmute (HW uses destination (TX) FIFO data)
*
* \param base pointer to the Mixer TX Struct instance
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Tx_Unmute
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_Unmute(volatile MIXER_TX_STRUCT_Type * base)
{
    MIXER_TX_STRUCT_TX_FIFO_CTL(base) &= ~MIXER_MIXER_TX_STRUCT_TX_FIFO_CTL_MUTE_Msk;
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_ActivateTransmitter
****************************************************************************//**
*
* Activate or deactivate the Mixer transmitter
*
* \param base pointer to the Mixer TX Struct instance
* \param state
* true = transmitter on \n
* false = transmitter off
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_TransmitInit
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_ActivateTransmitter(volatile MIXER_TX_STRUCT_Type * base, bool state)
{
    if (state)
    {
        MIXER_TX_STRUCT_TX_FIFO_CTL(base) |= MIXER_MIXER_TX_STRUCT_TX_FIFO_CTL_ACTIVE_Msk;
    }
    else
    {
        MIXER_TX_STRUCT_TX_FIFO_CTL(base) &= ~MIXER_MIXER_TX_STRUCT_TX_FIFO_CTL_ACTIVE_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_Replay
****************************************************************************//**
*
* Mixer transmitter replay control
*
* \param base pointer to the Mixer TX Struct instance
* \param state
* true = replay on (HW uses previous PCM data value) \n
* false = replay off (HW uses a constant PCM data value of "0")
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_Replay(volatile MIXER_TX_STRUCT_Type * base, bool state)
{
    if (state)
    {
        MIXER_TX_STRUCT_TX_FIFO_CTL(base) |= MIXER_MIXER_TX_STRUCT_TX_FIFO_CTL_REPLAY_Msk;
    }
    else
    {
        MIXER_TX_STRUCT_TX_FIFO_CTL(base) &= ~MIXER_MIXER_TX_STRUCT_TX_FIFO_CTL_REPLAY_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_ClearInterrupt
****************************************************************************//**
*
* Mixer Tx Interrupt Clear
*
* \param base pointer to the Mixer TX Struct instance
* \param intSrc \ref cy_stc_mixer_tx_int_src_t
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Tx_ClearInterrupt
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_ClearInterrupt(volatile MIXER_TX_STRUCT_Type * base, cy_stc_mixer_tx_int_src_t intSrc)
{
    switch (intSrc)
    {
    case CY_MIXER_TX_FIFO_UNDERFLOW:
        MIXER_TX_STRUCT_INTR_TX(base) = MIXER_MIXER_TX_STRUCT_INTR_TX_FIFO_UNDERFLOW_Msk;
        break;
    case CY_MIXER_TX_IFC_UNDERFLOW:
        MIXER_TX_STRUCT_INTR_TX(base) = MIXER_MIXER_TX_STRUCT_INTR_TX_IF_UNDERFLOW_Msk;
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_SetInterrupt
****************************************************************************//**
*
* Mixer Tx Interrupt Set
*
* \param base pointer to the Mixer TX Struct instance
* \param intSrc \ref cy_stc_mixer_tx_int_src_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_SetInterrupt(volatile MIXER_TX_STRUCT_Type * base, cy_stc_mixer_tx_int_src_t intSrc)
{
    switch (intSrc)
    {
    case CY_MIXER_TX_FIFO_UNDERFLOW:
        MIXER_TX_STRUCT_INTR_TX_SET(base) = MIXER_MIXER_TX_STRUCT_INTR_TX_SET_FIFO_UNDERFLOW_Msk;
        break;
    case CY_MIXER_TX_IFC_UNDERFLOW:
        MIXER_TX_STRUCT_INTR_TX_SET(base) = MIXER_MIXER_TX_STRUCT_INTR_TX_SET_IF_UNDERFLOW_Msk;
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_ClearInterruptMask
****************************************************************************//**
*
* Mixer Tx Interrupt Mask Clear
*
* \param base pointer to the Mixer TX Struct instance
* \param intSrc \ref cy_stc_mixer_tx_int_src_t
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Tx_SetInterruptMask
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_ClearInterruptMask(volatile MIXER_TX_STRUCT_Type * base, cy_stc_mixer_tx_int_src_t intSrc)
{
    switch (intSrc)
    {
    case CY_MIXER_TX_FIFO_UNDERFLOW:
        MIXER_TX_STRUCT_INTR_TX_MASK(base) &= ~MIXER_MIXER_TX_STRUCT_INTR_TX_MASK_FIFO_UNDERFLOW_Msk;
        break;
    case CY_MIXER_TX_IFC_UNDERFLOW:
        MIXER_TX_STRUCT_INTR_TX_MASK(base) &= ~MIXER_MIXER_TX_STRUCT_INTR_TX_MASK_IF_UNDERFLOW_Msk;
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_Mixer_Tx_SetInterruptMask
****************************************************************************//**
*
* Mixer Tx Interrupt Mask Set
*
* \param base pointer to the Mixer TX Struct instance
* \param intSrc \ref cy_stc_mixer_tx_int_src_t
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Tx_SetInterruptMask
*
*******************************************************************************/
__STATIC_INLINE void Cy_Mixer_Tx_SetInterruptMask(volatile MIXER_TX_STRUCT_Type * base, cy_stc_mixer_tx_int_src_t intSrc)
{
    switch (intSrc)
    {
    case CY_MIXER_TX_FIFO_UNDERFLOW:
        MIXER_TX_STRUCT_INTR_TX_MASK(base) |= MIXER_MIXER_TX_STRUCT_INTR_TX_MASK_FIFO_UNDERFLOW_Msk;
        break;
    case CY_MIXER_TX_IFC_UNDERFLOW:
        MIXER_TX_STRUCT_INTR_TX_MASK(base) |= MIXER_MIXER_TX_STRUCT_INTR_TX_MASK_IF_UNDERFLOW_Msk;
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }
}

