RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_mixer.h
/*******************************************************************************
* Function Name: Cy_Mixer_Tx_IsInterruptActive
****************************************************************************//**
*
* Get transmitter interrupt active state.
*
* \param base pointer to the Mixer TX Struct instance
* \param intSrc \ref cy_stc_mixer_tx_int_src_t
*
* \return
* true: interrupt is set
* false: interrupt is not set
*
* \funcusage
* \snippet mixer/snippet/main.c snippet_Cy_Mixer_Tx_ClearInterrupt
*
*******************************************************************************/
__STATIC_INLINE bool Cy_Mixer_Tx_IsInterruptActive(volatile MIXER_TX_STRUCT_Type * base, cy_stc_mixer_tx_int_src_t intSrc)
{
    bool intActive = false;

    switch (intSrc)
    {
    case CY_MIXER_TX_FIFO_UNDERFLOW:
        intActive = (0UL != (MIXER_TX_STRUCT_INTR_TX(base) & MIXER_MIXER_TX_STRUCT_INTR_TX_FIFO_UNDERFLOW_Msk));
        break;
    case CY_MIXER_TX_IFC_UNDERFLOW:
        intActive = (0UL != (MIXER_TX_STRUCT_INTR_TX(base) & MIXER_MIXER_TX_STRUCT_INTR_TX_IF_UNDERFLOW_Msk));
        break;
    default:
        /* Invalid interrupt source */
        CY_ASSERT_L3(false);
        break;
    }

    return intActive;
}

#endif /* (defined(MIXER0_TX_PRESENT) && (MIXER0_TX_PRESENT == 1)) || (defined(MIXER1_TX_PRESENT) && (MIXER1_TX_PRESENT == 1)) */

/** \} group_mixer_functions */

#if defined(__cplusplus)
}
#endif /* __cplusplus */

#endif /* CY_IP_MXMIXER */

#endif /* __CY_MIXER_H__ */

/** \} group_mixer */

/* [] END OF FILE */
